app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:song_list].path, headers: true) do |song|
      new_song = Song.create(title: song[0])
---
INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2018-08-08 16:52:00.301323"], ["updated_at", "2018-08-08 16:52:00.301323"]]